app/Controllers/Admin.php

SELECT *
FROM `users`
WHERE `email` = 'admin@gmail.com'
 LIMIT 1
---
    public function __construct()
    {
        $this->validation = \Config\Services::validation();
        $this->ProfileModel = new ProfileModel();
        $this->MilestoneModel = new MilestoneModel();
        $this->KontakModel = new KontakModel();
        $this->FaqModel = new FaqModel();
        $this->CourseModel = new CourseModel();
        $this->SubCourseModel = new SubCourseModel();
        $this->TeamModel = new TeamModel();
        $this->PortofolioModel = new PortofolioModel();
        $this->KlienModel = new KlienModel();
        $this->ArtikelModel = new ArtikelModel();
        $this->UsersModel = new UsersModel();
        $this->PembayaranModel = new PembayaranModel();
        $this->user =  $this->UsersModel->where('email', session()->get('swevel_email'))->first();

SELECT *
FROM `artikel`
WHERE `slug` = 'Nice-Laptop'
 LIMIT 1
---
    public function edit_artikel($slug)
    {

        $data = [
            'user' => $this->user,
            'title' => 'Edit Artikel',
            'artikel' => $this->ArtikelModel->where('slug', $slug)->first(),

SELECT *
FROM `profile`
---
    public function profile()
    {
        $data = [
            'user' => $this->user,
            'title' => 'profile',
            'profile' => $this->ProfileModel->findAll(),