app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'admin@gmail.com'
 LIMIT 1
---
    public function verifikasi_login(){
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');
        $payment = $this->request->getVar('payment');

        $user = $this->UsersModel->where('email',$email)->first();