app/Controllers/Course.php

SELECT *
FROM `kontak`
---
    public function index($category = null)
    {
        if ($category == null) {
            $category = 'Software Development';
        }

        $data = [
            'title' => 'Course',
            'category' => $category,
            'kontak' => $this->KontakModel->findAll(),