app/Controllers/Home.php

    public function index()
    {
        $data = [
            'title' => 'PT Swevel Universal Media',
            'profile' => $this->ProfileModel->findAll(),
            'milestoneLimit' => $this->MilestoneModel->orderBy('year', 'asc')->findAll(2),
            'milestone' => $this->MilestoneModel->orderBy('year', 'asc')->findAll(),
            'kontak' => $this->KontakModel->findAll(),
            'team' => $this->TeamModel->findAll(),
            'portofolio' => $this->PortofolioModel->findAll(),
            'klien' => $this->KlienModel->findAll(),
            'portofolio_limit' => $this->PortofolioModel->findAll(8),
            'artikel' => $this->ArtikelModel->limit(3)->findAll(),
---
SELECT *
FROM `profile`
SELECT *
FROM `milestone`
ORDER BY `year` ASC
 LIMIT 2
SELECT *
FROM `milestone`
ORDER BY `year` ASC
SELECT *
FROM `kontak`
SELECT *
FROM `team`
SELECT *
FROM `portofolio`
SELECT *
FROM `klien`
SELECT *
FROM `portofolio`
 LIMIT 8
SELECT *
FROM `artikel`
 LIMIT 3

    public function pendampingan(){
        $data = [
            'title' => 'Pendampingan',
            'kontak' => $this->KontakModel->findAll(),
---
SELECT *
FROM `kontak`